Revit 2027 API
ElectricalSetting.CircuitPathOffset Property
 The default circuit path offset for newly created circuit.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CircuitPathOffset { get; set; }
Public Property CircuitPathOffset As Double
	Get
	Set
public:
property double CircuitPathOffset {
	double get ();
	void set (double value);
}
member CircuitPathOffset : float with get, set
Property Value
Double
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace